## Lamda Function

In [2]:
import pandas as pd
df = pd.DataFrame({
    'Name': ['Ravi','Anil','Arti'],
    'Status': ['Younger_Brother', 'Older_Brother', 'Sister'],
    'Birthyear': [1999, 1997, 2001],
})

In [3]:
df

   Name           Status  Birthyear
0  Ravi  Younger_Brother       1999
1  Anil    Older_Brother       1997
2  Arti           Sister       2001

In [4]:
df['Age'] = df['Birthyear'].apply(lambda x : 2022 - x)

In [5]:
df

   Name           Status  Birthyear  Age
0  Ravi  Younger_Brother       1999   23
1  Anil    Older_Brother       1997   25
2  Arti           Sister       2001   21

In [6]:
df['Age_map'] = df['Birthyear'].map(lambda x : 2022 - x)

In [7]:
df

   Name           Status  Birthyear  Age  Age_map
0  Ravi  Younger_Brother       1999   23       23
1  Anil    Older_Brother       1997   25       25
2  Arti           Sister       2001   21       21

In [8]:
df['Flag_age_greater_than_21'] = df['Age'].map(lambda x : 1 if x>21 else 0)

In [9]:
df

   Name           Status  Birthyear  Age  Age_map  Flag_age_greater_than_21
0  Ravi  Younger_Brother       1999   23       23                         1
1  Anil    Older_Brother       1997   25       25                         1
2  Arti           Sister       2001   21       21                         0

In [10]:
list(filter(lambda x: x>21, df['Age']))

[23, 25]

In [11]:
df['Sex'] = df['Status'].map(lambda x : 'Male' if x =='Younger_Brother' or x == 'Older_Brother' else 'Female')

In [12]:
df

,Name,Status,Birthyear,Age,Age_map,Flag_age_greater_than_21,Sex
0,Ravi,Younger_Brother,1999,23,23,1,Male
1,Anil,Older_Brother,1997,25,25,1,Male
2,Arti,Sister,2001,21,21,0,Female